app/views/projects/_pledge_div.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 26]]
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."project_id" = $1  [["project_id", 1]]
---
	<h4 class="pledge-title"><%= r.title %></h4>
	<h6 class="patron-count"><%= r.project.subscriptions.count %> Backers</h6>