app/views/projects/index.html.erb

		              <div class="listing-summary">
		                <p class="backers-count"><strong><%= p.subscriptions.count %></strong>
---
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."project_id" = $1  [["project_id", 1]]