app/views/projects/show.html.erb

          <div class="summary-stats">
            <h1 class="summary-h1"><%= @project.subscriptions.count %></h1>
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."project_id" = $1  [["project_id", 1]]
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."project_id" = $1  [["project_id", 1]]

                  <h5 class="rewards-title">Rewards</h5>
									<% @project.rewards_tiers.each do |r| %>
---
SELECT "rewards_tiers".* FROM "rewards_tiers" WHERE "rewards_tiers"."project_id" = $1  [["project_id", 1]]