app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hey, this is the first comment!\r\n"], ["user_id", 4], ["project_id", 40], ["created_at", "2017-02-21 01:23:04.414469"], ["updated_at", "2017-02-21 01:23:04.414469"]]
---
  def create
    @comment = Comment.new comment_params
    if @comment.save