app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "adsf"], ["body", "adfadsfdsafasdfs"], ["project_id", 40], ["created_at", "2017-02-20 22:25:50.833072"], ["updated_at", "2017-02-20 22:25:50.833072"]]
---
  def create
    @post = Post.new post_params
    if @post.save