app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
		if params[:id]
			@project = Project.find(params[:id])

INSERT INTO "projects" ("user_id", "title", "format", "charge_occurrence", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 3], ["title", "lkj"], ["format", "ljlk"], ["charge_occurrence", "monthly"], ["body", "lkj"], ["created_at", "2017-02-15 22:24:40.419530"], ["updated_at", "2017-02-15 22:24:40.419530"]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 31]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
  def create
    @project = Project.new project_params
		# If User does not have Stripe account_id, create one
		@account = Account.where(user_id: @project.user.id).first
		unless @account
			# Create a User.Account
			Account.create(user_id: current_user.id)
			@account = Account.where(user_id: @project.user.id).first
		end
		unless @account && StripeInfo.where(account_id: @account.id).first
			# Create StripeInfo record
			StripeInfo.create(account_id: @account.id)
		end
		unless @account && StripeInfo.where(account_id: @account.id).first.stripe_id
			# Create Managed Stripe Account
			stripe_account = Stripe::Account.create(
			  {
			    :country => @project.user.country.code, #"US",
			    :managed => true
			  }
			)